ideas.org
* Discord Forum bot
- Forces everything into threads
- Prompts user for information about their question
- Adds upvote/downvote buttons
- Lets you mark a message as containing the correct answer.
- Bot keeps record of this in website too with more accessible search for it to be a "proper" forum
- Bot can also work in other communities too, like Slack, since it has threads

* Clojure API library
- Add metadata maps to functions to create APIs
#+BEGIN_SRC clojure
(defn get-users {:get "/users"
                 :query-params [a b c]}
  [req]
  (list-users))
#+END_SRC
- Maybe could alternatively make this a WebRTC thing? I've been interested in HTML over the wire...

* Clojure + Svelte library?
#+BEGIN_SRC clojure
(def val (atom "hello"))

(html
 (div (p "Hello" @val)))
#+END_SRC
Idk, but svelte seems nice and easy, and would nice to have access to it through ClojureScript
